mentalibor/STM32f446RE_drivers/Inc/stm32f44xx_spi.h
/*
 * stm32f44xx_spi.h
 *
 *  Created on: Feb 5, 2021
 *      Author: Mentalibor
 */

#ifndef INC_STM32F44XX_SPI_H_
#define INC_STM32F44XX_SPI_H_

#include "stm32f44xx.h"

/*
 *  Configuration structure for SPIx peripheral
 */
typedef struct
{
	uint8_t SPI_DeviceMode; 	/*possible values from @SPI_DeviceMode*/
	uint8_t SPI_BusConfig;		/*possible values from @SPI_BusConfig*/
	uint8_t SPI_SclkSpeed;		/*possible values from @SPI_SclkSpeed*/
	uint8_t SPI_DFF;			/*possible values from @SPI_DFF*/
	uint8_t SPI_CPOL;			/*possible values from @CPOL*/
	uint8_t SPI_CPHA;			/*possible values from @CPHA*/
	uint8_t SPI_SSM;			/*possible values from @SPI_SSM*/
}SPI_Config_t;


/*
 *Handle structure for SPIx peripheral
 */
typedef struct
{
	SPI_RegDef_t 	*pSPIx;   	/*!< This holds the base address of SPIx(x:0,1,2,4) peripheral >*/
	SPI_Config_t 	SPIConfig;
	uint8_t 		*pTxBuffer; /* !< To store the app. Tx buffer address > */
	uint8_t 		*pRxBuffer;	/* !< To store the app. Rx buffer address > */
	uint32_t 		TxLen;		/* !< To store Tx len > */
	uint32_t 		RxLen;		/* !< To store Tx len > */
	uint8_t 		TxState;	/* !< To store Tx state > */
	uint8_t 		RxState;	/* !< To store Rx state > */
}SPI_Handle_t;

/*
 * SPI application states
 */
#define SPI_READY 							0
#define SPI_BUSY_IN_RX 						1
#define SPI_BUSY_IN_TX 						2

/*
 * Possible SPI Application events
 */
#define SPI_EVENT_TX_CMPLT   				1
#define SPI_EVENT_RX_CMPLT   				2
#define SPI_EVENT_OVR_ERR   				3
#define SPI_EVENT_CRC_ERR   				4


/*
 * @SPI_DeviceMode
 */
#define SPI_DEVICE_MODE_MASTER    			1
#define SPI_DEVICE_MODE_SLAVE     			0

/*
 * @SPI_BusConfig
 */
#define SPI_BUS_CONFIG_FD                	1
#define SPI_BUS_CONFIG_HD                	2
#define SPI_BUS_CONFIG_SIMPLEX_RXONLY    	3

/*
 * @SPI_SclkSpeed
 */
#define SPI_SCLK_SPEED_DIV2             	0
#define SPI_SCLK_SPEED_DIV4             	1
#define SPI_SCLK_SPEED_DIV8             	2
#define SPI_SCLK_SPEED_DIV16             	3
#define SPI_SCLK_SPEED_DIV32             	4
#define SPI_SCLK_SPEED_DIV64             	5
#define SPI_SCLK_SPEED_DIV128             	6
#define SPI_SCLK_SPEED_DIV256             	7

/*
 * @SPI_DFF
 */
#define SPI_DFF_8BITS 						0
#define SPI_DFF_16BITS  					1

/*
 * @CPOL
 */
#define SPI_CPOL_HIGH 						1
#define SPI_CPOL_LOW 						0

/*
 * @CPHA
 */
#define SPI_CPHA_HIGH 						1
#define SPI_CPHA_LOW 						0

/*
 * @SPI_SSM
 */
#define SPI_SSM_EN    						1
#define SPI_SSM_DI     						0

/*
 * SPI related status flags definitions
 */
#define SPI_TXE_FLAG    					( 1 << SPI_SR_TXE)
#define SPI_RXNE_FLAG   					( 1 << SPI_SR_RXNE)
#define SPI_BUSY_FLAG   					( 1 << SPI_SR_BSY)

/******************************************************************************************
 *								APIs supported by this driver
 ******************************************************************************************/


/*
 * Peripheral Clock Setup
 */
/*******************************************************************************
 * @ingroup api_spi
 * @brief Enables or disables the SPI peripheral clock
 *
 * @param[in]   pSPIx   Reference to the SPI definition structure
 * @param[in]   EnorDi  ENABLE/DISABLE macro
 *
 ******************************************************************************/
void SPI_PerClockControl ( SPI_RegDef_t *pSPIx
						 , uint8_t EnorDi
						 );

/*
 * Initialization and deinitialization
 */
/*******************************************************************************
 * @ingroup api_spi
 * @brief Initializes the SPI peripheral
 *
 * @param[in]   pSPIHandler  Reference to the SPI handler
 *
 ******************************************************************************/
void SPI_Init(SPI_Handle_t *pSPIHandler);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Deinitializes the SPI peripheral
 *
 * @param[in]   pSPIx   Reference to the SPI definition structure
 *
 ******************************************************************************/
void SPI_DeInit(SPI_RegDef_t *pSPIx);

/*
 * Send and Receive Data
 */

/*******************************************************************************
 * @ingroup api_spi
 * @brief Sends data in blocking mode
 *
 * @param[in]   pSPIx   	Reference to the SPI definition structure
 * @param[in]	pTxbuffer	Reference to the TX buffer
 * @param[in]	length		Length of the TX buffer
 *
 ******************************************************************************/
void SPI_SendData	( SPI_RegDef_t *pSPIx
					, uint8_t *pTxBuffer
					, uint32_t length
					);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Receives data in blocking mode
 *
 * @param[in]   pSPIx   	Reference to the SPI definition structure
 * @param[in]	pRxBuffer	Reference to the RX buffer
 * @param[in]	length		Length of the RX buffer
 *
 ******************************************************************************/
void SPI_ReceiveData ( SPI_RegDef_t *pSPIx
					 , uint8_t *pRxBuffer
					 , uint32_t length
					 );

/*******************************************************************************
 * @ingroup api_spi
 * @brief Sends data in non-blocking mode
 *
 * @param[in]   pSPIHandler Reference to the SPI handler
 * @param[in]	pTxbuffer	Reference to the TX buffer
 * @param[in]	length		Length of the TX buffer
 *
 * @return uint8_t
 * @retval SPI_BUSY_IN_RX
 * @retval SPI_BUSY_IN_TX
 * @retval SPI_READY
 ******************************************************************************/
uint8_t SPI_SendDataInterrupt	( SPI_Handle_t *pSPIHandle
								, uint8_t *pTxBuffer
								, uint32_t Len
								);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Receives data in non-blocking mode
 *
 * @param[in]   pSPIHandler Reference to the SPI handler
 * @param[in]	pRxbuffer	Reference to the RX buffer
 * @param[in]	length		Length of the RX buffer
 *
 * @return uint8_t
 * @retval SPI_BUSY_IN_RX
 * @retval SPI_BUSY_IN_TX
 * @retval SPI_READY
 ******************************************************************************/
uint8_t SPI_ReceiveDataInterrupt	( SPI_Handle_t *pSPIHandle
									, uint8_t *pRxBuffer
									, uint32_t Len
									);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Enables or disables the SPI peripheral
 *
 * @param[in]   pSPIx   Reference to the SPI definition structure
 * @param[in]   EnorDi  ENABLE/DISABLE macro
 *
 ******************************************************************************/
void SPI_PeripheralControl	( SPI_RegDef_t *pSPIx
							, uint8_t EnOrDi
							);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Configures the SSI of the	corresponding SPI peripheral
 *
 * @param[in]   pSPIx   Reference to the SPI definition structure
 * @param[in]   EnorDi  ENABLE/DISABLE macro
 *
 ******************************************************************************/
void SPI_SSIConfig	( SPI_RegDef_t *pSPIx
					, uint8_t EnOrDi
					);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Configures the SSOE of the corresponding SPI peripheral
 *
 * @param[in]   pSPIx   Reference to the SPI definition structure
 * @param[in]   EnorDi  ENABLE/DISABLE macro
 *
 ******************************************************************************/
void SPI_SSOEConfig ( SPI_RegDef_t *pSPIx
					, uint8_t EnOrDi
					);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Clears the OVR flag
 *
 * @param[in]   pSPIx   	Reference to the SPI definition structure
 *
 ******************************************************************************/
void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Closes the SPI transmission
 *
 * @param[in]   pSPIHandle  Reference to the SPI handler
 *
 ******************************************************************************/
void SPI_CloseTransmisson(SPI_Handle_t *pSPIHandle);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Closes the SPI reception
 *
 * @param[in]   pSPIHandle  Reference to the SPI handler
 *
 ******************************************************************************/
void SPI_CloseReception(SPI_Handle_t *pSPIHandle);

/*
 * IRQ Configuration and ISR handling
 */
/*******************************************************************************
 * @ingroup api_spi
 * @brief Enables or disables the corresponding IRQ
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	EnorDi		Enable or disable macro
 *
 ******************************************************************************/
void SPI_IRQInterruptConfig ( uint8_t IRQNumber
							, uint8_t EnorDi
							);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Configures the IRQ priority
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	IRQPriority	IRQ priority
 *
 ******************************************************************************/
void SPI_IRQPriorityConfig	( uint8_t IRQNumber
							, uint32_t IRQPriority
							);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Handles the interrupt
 *
 * @param[in]   pHandle  Reference to the SPI handler
 *
 ******************************************************************************/
void SPI_IRQHandling(SPI_Handle_t *pSPIHandle);

/*******************************************************************************
 * @ingroup api_spi
 * @brief Application event callback function
 *
 * @param[in]   pSPIHandle  Reference to the SPI handler
 * @param[in]   AppEv  		application event macro
 *
 ******************************************************************************/
void SPI_ApplicationEventCallback	( SPI_Handle_t *pSPIHandle
									, uint8_t AppEv
									);


#endif /* INC_STM32F44XX_SPI_H_ */
